---
type: AnalysisDisplayDeformedShapeSettings
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 13
tags: [revit-api, class]
---

# AnalysisDisplayDeformedShapeSettings

`Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AnalysisDisplayDeformedShapeSettings | — | `` |
| Constructor | AnalysisDisplayDeformedShapeSettings | 2013 | `public AnalysisDisplayDeformedShapeSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2013 | `public bool IsEqual ( AnalysisDisplayDeformedShapeSettings other )` |
| Property | GridColor | 2013 | `public Color GridColor { get ; set ; }` |
| Property | GridLineWeight | 2013 | `public int GridLineWeight { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Rounding | 2013 | `public double Rounding { get ; set ; }` |
| Property | ShowContourLines | 2013 | `public bool ShowContourLines { get ; set ; }` |
| Property | ShowGridLines | 2013 | `public bool ShowGridLines { get ; set ; }` |
| Property | TextLabelType | 2013 | `public AnalysisDisplayStyleDeformedShapeTextLabelType TextLabelType { get ; set ; }` |
| Property | TextTypeId | 2013 | `public ElementId TextTypeId { get ; set ; }` |
| Property | Transparency | 2013 | `public int Transparency { get ; set ; }` |